# -*- coding=utf-8 -*-

class UnicodeDict(dict):
    def __getitem__(self, key):
        value = super(UnicodeDict, self).__getitem__(key)
        try:
            value = unicode(value)
        except:
            pass
        return value


ERRORS = UnicodeDict({
    0: (""),  # 成功
    1: _("查询参数错误"),

    # 40001: _("请输入名"),
    # 40002: _("请输入邮件地址"),
    # 40003: _("请输入密码"),
    # 40004: _("用户名长度应为2~30个字符"),
    # 40005: _("用户名只能包含中文字符、英文字母、数字和下划线(_)"),
    # 40006: _("请输入正确的邮件地址"),
    # 40007: _("密码至少6位"),
    # 40008: _("用户名已被使用"),
    # 40009: _("邮件地址已被使用"),
    # 40010: _("请输入用户名或邮件地址"),
    # 40011: _("登录名或密码错误"),
    # 40012: _("此用户已被删除"),
    # 40013: _("请输入现在的密码"),
    # 40014: _("请输入新密码"),
    # 40015: _("请再次输入新密码"),
    # 40016: _("密码错误"),
    # 40017: _("两次输入的新密码不一致"),
    # 40018: _("请选择头像"),
    # 40019: _("此行程已被删除"),
    # 40020: _("有行程正在进行中"),
})
